# Load the design
read_verilog ../build/gpu.v

# Isolate the target module
hierarchy -top gpu

# Perform synthesis
synth

techmap -map libertyfile

# write the synthesized netlist for further analysis
write_json synth_out.json
write_verilog synth_out.v

# Show detailed statistics
stat 
